# Basic compilation tools
brew "cmake"
# And its documentation
brew "cmake-docs"
# C source formatting
brew "clang-format"
# Non-make build system for cmake/etc.
brew "ninja"
# Ghostscript for PDF generation
brew "ghostscript"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ruby scripting
brew "ruby"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Foreman clone written in Go
# brew "goreman"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Basic spelling tools
brew "ispell"
# XML security library
brew "libxmlsec1"
# Mac App Store command-line interface
brew "mas"
# Open LLM model executor
brew "ollama"
# Modern implementation of SSH
brew "openssh"
# Framework for layout and rendering of i18n text
brew "pango"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Run AI agents isolated in a sandboxed macOS user account
brew "sandvault"
# Autoformat shell script source code
brew "shfmt"
# Human-friendly alternative to netstat for socket and port monitoring
brew "somo"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Password manager that keeps all passwords secure behind one password
brew "lastpass-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# App to build and share containerised applications and microservices
# cask "docker-desktop"
# Terminal for orchestrating agents
cask "superset"
# Open-source code editor
cask "vscodium"
# Video communication and virtual meeting platform
cask "zoom"
# Additional lastpass setups
gem "lastpass-ssh"
mas "LastPass for Safari", id: 6504626762
mas "Slack", id: 803453959
# VSCodium extensions
#vscode "anykeyh.simplecov-vscode"
#vscode "ban.spellright"
#vscode "charliermarsh.ruff"
#vscode "davidanson.vscode-markdownlint"
#vscode "davidbwaters.macos-modern-theme"
#vscode "editorconfig.editorconfig"
#vscode "foxundermoon.shell-format"
#vscode "github.codespaces"
#vscode "github.copilot-chat"
#vscode "github.vscode-github-actions"
#vscode "github.vscode-pull-request-github"
#vscode "ms-azuretools.vscode-containers"
#vscode "ms-python.debugpy"
#vscode "ms-python.python"
#vscode "ms-python.vscode-pylance"
#vscode "ms-python.vscode-python-envs"
#vscode "ms-vscode-remote.remote-containers"
#vscode "ms-vsliveshare.vsliveshare"
#vscode "redhat.vscode-yaml"
#vscode "shopify.ruby-lsp"
#vscode "sorbet.sorbet-vscode-extension"
#vscode "timonwong.shellcheck"
